## Step 2 - Database Engineering

-- Use SQLAlchemy to model your table schemas and create a sqlite database for your tables. You will need one table for measurements and one for stations.

-- Create a Jupyter Notebook called `database_engineering.ipynb` and use this to complete all of your Database Engineering work.

-- Use Pandas to read your cleaned measurements and stations CSV data.

-- Use the `engine` and connection string to create a database called `hawaii.sqlite`.

-- Use `declarative_base` and create ORM classes for each table.

-- You will need a class for `Measurement` and for `Station`.

-- Make sure to define your primary keys.

-- Once you have your ORM classes defined, create the tables in the database using `create_all`.

In [32]:
#Import dependencies
import pandas as pd

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect, func, Column, Integer, String, Float, Date
from sqlalchemy.ext.declarative import declarative_base

In [33]:
# read in cleaned csvs
measurements_df = pd.read_csv("Homework/Instructions/Resources/clean_hawaii_measurements.csv", index_col=0)
stations_df = pd.read_csv("Homework/Instructions/Resources/clean_hawaii_stations.csv", index_col=0)

In [34]:
measurements_df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
5  USC00519397  2010-01-07  0.06    70

In [35]:
stations_df.head()

,station,name,latitude,longitude,elevation
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
1,USC00513117,"KANEOHE 838.1, HI US",21.4234,-157.8015,14.6
2,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.5213,-157.8374,7.0
3,USC00517948,"PEARL CITY, HI US",21.3934,-157.9751,11.9
4,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.4992,-158.0111,306.6

In [36]:
# Use the engine and connection string to create a database called hawaii.sqlite
engine = create_engine("sqlite:///Homework/Instructions/Resources/hawaii.sqlite")

In [37]:
# Use declarative_base and create ORM classes for each table
Base = declarative_base()

In [38]:
# You will need a class for Measurement and for Station
class Measurement(Base):
    __tablename__ = 'Measurement'
    id = Column(Integer, primary_key=True)
    station = Column(String(255))
    date = Column(String(255))
    prcp = Column(Integer)
    tobs = Column(Integer)

class Station(Base):
    __tablename__ = 'Station'
    id = Column(Integer, primary_key=True)
    station = Column(String(255))
    name = Column(String(255))
    latitude = Column(Integer)
    longitude = Column(Integer)
    elevation = Column(Integer)

In [39]:
# Once you have your ORM classes defined, create the tables in the database using create_all.
Base.metadata.create_all(engine)

In [41]:
engine.table_names()

['Measurement', 'Station']

In [42]:
 # Populate a table from a Pandas DataFrame
def populate_table(engine, table, csvfile):
   
    # connect to the database
    conn = engine.connect()
    
    # Load the CSV file into a pandas dataframe 
    df_of_data_to_insert = pd.read_csv(csvfile)
    
    # Orient='records' creates a list of data to write
    # http://pandas-docs.github.io/pandas-docs-travis/io.html#orient-options
    data = df_of_data_to_insert.to_dict(orient='records')

    # Optional: Delete all rows in the table 
    conn.execute(table.delete())

    # Insert the dataframe into the database in one bulk insert
    conn.execute(table.insert(), data)
    
populate_table(engine, Station.__table__, "Homework/Instructions/Resources/clean_hawaii_stations.csv")

populate_table(engine, Measurement.__table__, "Homework/Instructions/Resources/clean_hawaii_measurements.csv")